HCHCHC99/HB_chuchai_v2.0.0/project/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/Dev/dev_motor.c
    /* CH2(PB7) - 低有效 */
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH2, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH2, ENABLE);

    /* CH3(PB8) - 低有效 */
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH3, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH3, ENABLE);

    /* CH4(PB9) - 低有效 */
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH4, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH4, ENABLE);
}
#endif

__weak void Motor_OnArbitrationStop(MotorDevice_t* motor) {
    (void)motor;
#if MOTOR_CONTROL_MODE == 0
    // === GPIO 模式 ===
    GPIO_SET(PHU_PORT, PHU_PIN);
    GPIO_SET(PHV_PORT, PHV_PIN);

    motor_state = 0;

#elif MOTOR_CONTROL_MODE == 1
    // === PWM 模式：急停，立即设置停止极性 ===
    Motor_SetStopDuty();

    s_bPolaritySwitchPending = false;
    s_eLastArbitrationDir = DIR_NONE;
    s_u16LastTargetDuty = 0;

    motor_state = 0;
#endif
}


__weak void Motor_OnArbitrationFwd(MotorDevice_t* motor, float duty) {
    (void)motor;
#if MOTOR_CONTROL_MODE == 0
    // === GPIO 模式 ===
    (void)duty;
    tickTimer_DelayMs(100);
if (g_AppParam.motor_dir != 0) {
        GPIO_SET(PHV_PORT, PHV_PIN);
        GPIO_RESET(PHU_PORT, PHU_PIN);
} else {
        GPIO_SET(PHU_PORT, PHU_PIN);
        GPIO_RESET(PHV_PORT, PHV_PIN);
}

    motor_state = 1;

#elif MOTOR_CONTROL_MODE == 1
    // === PWM 模式 ===
    uint16_t duty_percent = (uint16_t)(duty);

    if (s_eLastArbitrationDir != DIR_FWD || s_u16LastTargetDuty != duty_percent) {
if (g_AppParam.motor_dir != 0) {
        Motor_RampReverse(duty_percent);
} else {
        Motor_RampForward(duty_percent);
}
        s_eLastArbitrationDir = DIR_FWD;
        s_u16LastTargetDuty = duty_percent;
    }
    motor_state = 1;
#endif
}


__weak void Motor_OnArbitrationRev(MotorDevice_t* motor, float duty) {
    (void)motor;
#if MOTOR_CONTROL_MODE == 0
    // === GPIO 模式 ===
    (void)duty;
    tickTimer_DelayMs(100);
if (g_AppParam.motor_dir != 0) {
        GPIO_SET(PHU_PORT, PHU_PIN);
        GPIO_RESET(PHV_PORT, PHV_PIN);
} else {
        GPIO_SET(PHV_PORT, PHV_PIN);
        GPIO_RESET(PHU_PORT, PHU_PIN);
}

    motor_state = 2;

#elif MOTOR_CONTROL_MODE == 1
    // === PWM 模式 ===
    uint16_t duty_percent = (uint16_t)(duty);

    if (s_eLastArbitrationDir != DIR_REV || s_u16LastTargetDuty != duty_percent) {
if (g_AppParam.motor_dir != 0) {
        Motor_RampForward(duty_percent);
} else {
        Motor_RampReverse(duty_percent);
}
        s_eLastArbitrationDir = DIR_REV;
        s_u16LastTargetDuty = duty_percent;
    }
    motor_state = 2;
#endif
}


// ========== 内部函数声明 ==========
static const MotorDeviceGene_t* Motor_GetGene(MotorDeviceId_t id);
static void Motor_CmdList_Remove(MotorCommandList_t* q, MotorDeviceId_t id);
static void Motor_CmdList_SetAllow(MotorCommandList_t* q, MotorControlCommand_t cmd);
static void Motor_CmdList_SetBlock(MotorCommandList_t* q, MotorControlCommand_t cmd);
static void Motor_ArbitrationDecision(MotorDevice_t* motor);
static void Motor_UpdateDebugInfo(MotorDevice_t* motor);

// ========== 内部函数实现 ==========

static const MotorDeviceGene_t* Motor_GetGene(MotorDeviceId_t id) {
    for(int i = 0; i < sizeof(c_device_genes)/sizeof(MotorDeviceGene_t); i++) {
        if(c_device_genes[i].id == id) return &c_device_genes[i];
    }
    return NULL;
}

static void Motor_CmdList_Remove(MotorCommandList_t* q, MotorDeviceId_t id) {
    if (id == DEV_ID_RTURN_FWD || id == DEV_ID_RTURN_REV) {
        MAIN_D("[REMOVE_DEBUG] Trying to remove id=%d from queue at 0x%p, current count=%d\r\n", 
               id, q, q->count);
        // 打印调用栈或当前位置
    }    
    for (int i = 0; i < q->count; i++) {
        if (q->commands[i].device_id == id) {
            MAIN_D("[REMOVE_DEBUG] FOUND and REMOVED id=%d from queue at 0x%p\r\n", id, q);            
            for (int j = i; j < q->count - 1; j++) {
                q->commands[j] = q->commands[j + 1];
            }
            q->count--;
            // 清空被移除的位置
            if (q->count < MAX_COMMANDS_PER_DIRECTION) {
                q->commands[q->count].device_id = DEV_ID_NONE;
                q->commands[q->count].priority = PRIO_NONE;
                q->commands[q->count].type = CMD_TYPE_NONE_USE;
                q->commands[q->count].param = 0.0f;
                q->commands[q->count].timestamp = 0;
            }
            // 实时更新 Keil Watch 独立变量
            if (q == &g_pMotor_Dev_Watch->block_fwd) {
                g_u8MotorDebug_BlockFwdCount = q->count;
            } else if (q == &g_pMotor_Dev_Watch->block_rev) {
                g_u8MotorDebug_BlockRevCount = q->count;
            } else if (q == &g_pMotor_Dev_Watch->allow_fwd) {
                g_u8MotorDebug_AllowFwdCount = q->count;
            } else if (q == &g_pMotor_Dev_Watch->allow_rev) {
                g_u8MotorDebug_AllowRevCount = q->count;
            }
            return;
        }
    }
}

static void Motor_CmdList_SetAllow(MotorCommandList_t* q, MotorControlCommand_t cmd) {
    Motor_CmdList_Remove(q, cmd.device_id);
    if (q->count >= MAX_COMMANDS_PER_DIRECTION) return;

    int idx = 0;
    for (; idx < q->count; idx++) {
        if (cmd.priority < q->commands[idx].priority) break;
    }

    for (int i = q->count; i > idx; i--) {
        q->commands[i] = q->commands[i - 1];
    }

    q->commands[idx] = cmd;
    q->count++;
    
    // 实时更新 Keil Watch 独立变量
    if (g_pMotor_Dev_Watch != NULL) {
        if (q == &g_pMotor_Dev_Watch->allow_fwd) {
            g_u8MotorDebug_AllowFwdCount = q->count;
        } else if (q == &g_pMotor_Dev_Watch->allow_rev) {
            g_u8MotorDebug_AllowRevCount = q->count;
        }
    }
}

static void Motor_CmdList_SetBlock(MotorCommandList_t* q, MotorControlCommand_t cmd) {
    for (int i = 0; i < q->count; i++) {
        if (q->commands[i].device_id == cmd.device_id) return;
    }
    if (q->count >= MAX_COMMANDS_PER_DIRECTION) return;
    q->commands[q->count++] = cmd;
    
    // 实时更新 Keil Watch 独立变量
    if (g_pMotor_Dev_Watch != NULL) {
        if (q == &g_pMotor_Dev_Watch->block_fwd) {
            g_u8MotorDebug_BlockFwdCount = q->count;
        } else if (q == &g_pMotor_Dev_Watch->block_rev) {
            g_u8MotorDebug_BlockRevCount = q->count;
        }
    }
}

static void Motor_UpdateDebugInfo(MotorDevice_t* motor) {
    MotorDebugInfo_t* d = &motor->debug_info;

    // 同步block_fwd数组
    d->block_fwd.count = motor->block_fwd.count;
    for(int i = 0; i < MAX_COMMANDS_PER_DIRECTION; i++) {
        if (i < d->block_fwd.count) {
            d->block_fwd.device_ids[i] = motor->block_fwd.commands[i].device_id;
        } else {
            d->block_fwd.device_ids[i] = DEV_ID_NONE;
        }
    }

    // 同步block_rev数组
    d->block_rev.count = motor->block_rev.count;
    for(int i = 0; i < MAX_COMMANDS_PER_DIRECTION; i++) {
        if (i < d->block_rev.count) {
            d->block_rev.device_ids[i] = motor->block_rev.commands[i].device_id;
        } else {
            d->block_rev.device_ids[i] = DEV_ID_NONE;
        }
    }

    // 同步allow_fwd数组
    d->allow_fwd.count = motor->allow_fwd.count;
    for(int i = 0; i < MAX_COMMANDS_PER_DIRECTION; i++) {
        if (i < d->allow_fwd.count) {
            d->allow_fwd.device_ids[i] = motor->allow_fwd.commands[i].device_id;
            d->allow_fwd.priorities[i] = motor->allow_fwd.commands[i].priority;
        } else {
            d->allow_fwd.device_ids[i] = DEV_ID_NONE;
            d->allow_fwd.priorities[i] = PRIO_NONE;
        }
    }

    // 同步allow_rev数组
    d->allow_rev.count = motor->allow_rev.count;
    for(int i = 0; i < MAX_COMMANDS_PER_DIRECTION; i++) {
        if (i < d->allow_rev.count) {
            d->allow_rev.device_ids[i] = motor->allow_rev.commands[i].device_id;
            d->allow_rev.priorities[i] = motor->allow_rev.commands[i].priority;
        } else {
            d->allow_rev.device_ids[i] = DEV_ID_NONE;
            d->allow_rev.priorities[i] = PRIO_NONE;
        }
    }

    d->state = motor->state;
    d->active_dir = motor->active_dir;
    d->active_device_id = motor->active_device_id;
    d->current_duty = motor->last_sent_duty;
    d->conflict_fault = motor->debug_info.conflict_fault;
    
