HCHCHC99/HB_chuchai_v2.0.0/project/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/Dev/dev_motor.c
        Motor_CmdList_Remove(&motor->block_fwd, dev_id_fwd);
        Motor_CmdList_Remove(&motor->block_rev, dev_id_rev);

        MAIN_D("Motor: %s released! Bus=%lu mV - Unblock both directions\r\n",
               alarm_name, ev->u32BusVoltageMv);
    }

    Motor_ArbitrationDecision(motor);
}

void Motor_OnRTurnLimit(void* payload) {
    RTurn_LimitEvent_t* ev = (RTurn_LimitEvent_t*)payload;

    DeviceNode_t* node = DeviceManager_Get(DEV_MOTOR_ID);
    if (!node || !node->private_data) return;

    MotorDevice_t* motor = (MotorDevice_t*)node->private_data;

    if (ev->u8IsActive) {
        // 限位触发，添加 BLOCK 指令（使用 RTurn 专用设备ID）
        MotorControlCommand_t cmd = {
            .device_id = (ev->u8Direction == RTURN_LIMIT_FORWARD) ? DEV_ID_RTURN_FWD : DEV_ID_RTURN_REV,
            .priority = PRIO_LIMIT,
            .timestamp = tickTimer_GetCount()
        };

        if (ev->u8Direction == RTURN_LIMIT_FORWARD) {
            cmd.type = CMD_TYPE_BLOCK_FWD;
            Motor_CmdList_SetBlock(&motor->block_fwd, cmd);
            // 同时清除 allow_fwd，确保即使 block 被移除，电机也不会继续正转
            Motor_ClearAllowFwd(motor);
            MAIN_D("Motor: RTurn forward limit triggered, block forward + clear allow_fwd\r\n");
        } else {
            cmd.type = CMD_TYPE_BLOCK_REV;
            Motor_CmdList_SetBlock(&motor->block_rev, cmd);
            // 同时清除 allow_rev，确保即使 block 被移除，电机也不会继续反转
            Motor_ClearAllowRev(motor);
            MAIN_D("Motor: RTurn reverse limit triggered, block reverse + clear allow_rev\r\n");
        }
    } else {
        // 限位解除，移除 BLOCK 指令（使用 RTurn 专用设备ID）
        MotorDeviceId_t id = (ev->u8Direction == RTURN_LIMIT_FORWARD) ? DEV_ID_RTURN_FWD : DEV_ID_RTURN_REV;
        if (ev->u8Direction == RTURN_LIMIT_FORWARD) {
            Motor_CmdList_Remove(&motor->block_fwd, id);
            MAIN_D("Motor: RTurn forward limit released\r\n");
        } else if (ev->u8Direction == RTURN_LIMIT_REVERSE) {
            Motor_CmdList_Remove(&motor->block_rev, id);
            MAIN_D("Motor: RTurn reverse limit released\r\n");
        } else {
            // 方向为0时，清除所有限位
            Motor_CmdList_Remove(&motor->block_fwd, DEV_ID_RTURN_FWD);
            Motor_CmdList_Remove(&motor->block_rev, DEV_ID_RTURN_REV);
        }
    }

    Motor_ArbitrationDecision(motor);
}

// ========== 电流告警回调 ==========
void Motor_OnCurrentAlarm(void* payload) {
    Current_AlarmEvent_t* ev = (Current_AlarmEvent_t*)payload;

    DeviceNode_t* node = DeviceManager_Get(DEV_MOTOR_ID);
    if (!node || !node->private_data) return;

    MotorDevice_t* motor = (MotorDevice_t*)node->private_data;

    if (ev->u8IsActive) {
        /* 判断当前电机方向：仅正转时过流才阻塞正转
         * 反转堵转属于预期工况（如阀门关闭到位），不阻塞正转 */
        MotorDir_t eDesiredDir = Motor_GetDesiredDirection(motor);
        
        if (eDesiredDir == DIR_FWD)
        {
            // 正转时过流 → 向 block_fwd 添加 DEV_ID_OVERCUR_FWD 阻塞指令
            MotorControlCommand_t block_fwd_cmd = {
                .device_id = DEV_ID_OVERCUR_FWD,
                .priority = PRIO_LIMIT,
                .type = CMD_TYPE_BLOCK_FWD,
                .timestamp = tickTimer_GetCount()
            };
            Motor_CmdList_SetBlock(&motor->block_fwd, block_fwd_cmd);

            MAIN_D("Motor: OVERCURRENT alarm (FWD)! Current=%ld mA, Threshold=%ld mA - Block forward!\r\n",
                   (long)ev->s32CurrentMa, (long)ev->s32ThresholdMa);
        }
        else
        {
            // 反转或停止时过流 → 不阻塞正转（反转堵转属于预期工况）
            MAIN_D("Motor: OVERCURRENT alarm (dir=%d, REV/STOP is normal stall)! Current=%ld mA, Threshold=%ld mA - Skip block forward\r\n",
                   (int)eDesiredDir, (long)ev->s32CurrentMa, (long)ev->s32ThresholdMa);
        }
    } else {
        // 过流告警解除 - 从 block_fwd 移除 DEV_ID_OVERCUR_FWD
        Motor_CmdList_Remove(&motor->block_fwd, DEV_ID_OVERCUR_FWD);

        MAIN_D("Motor: OVERCURRENT released! Current=%ld mA - Unblock forward\r\n",
               (long)ev->s32CurrentMa);
    }

    Motor_ArbitrationDecision(motor);
}


void Motor_OnHardLimit(void* payload) {
    MotorLimitEvent_t* ev = (MotorLimitEvent_t*)payload;
    DeviceNode_t* node = DeviceManager_Get(DEV_MOTOR_ID);
    if (!node || !node->private_data) return;

    MotorDevice_t* motor = (MotorDevice_t*)node->private_data;

    MotorDeviceId_t id = (ev->dir == DIR_FWD) ? DEV_ID_LIMIT_FWD : DEV_ID_LIMIT_REV;

    if (ev->is_active) {
        MotorControlCommand_t cmd = {
            .device_id = id,
            .timestamp = tickTimer_GetCount()
        };

        if (ev->dir == DIR_FWD) {
            cmd.type = CMD_TYPE_BLOCK_FWD;
            Motor_CmdList_SetBlock(&motor->block_fwd, cmd);
        } else {
            cmd.type = CMD_TYPE_BLOCK_REV;
            Motor_CmdList_SetBlock(&motor->block_rev, cmd);
        }
    } else {
        if (ev->dir == DIR_FWD) {
            Motor_CmdList_Remove(&motor->block_fwd, id);
        } else {
            Motor_CmdList_Remove(&motor->block_rev, id);
        }
    }

    Motor_ArbitrationDecision(motor);
}

void Motor_OnPowerEvent(void* payload) {
    MotorPowerEvent_t* ev = (MotorPowerEvent_t*)payload;
    MAIN_D("[MOTOR] OnPowerEvent: power_id=%d, is_on=%d\r\n", ev->power_id, ev->is_on);

    DeviceNode_t* node = DeviceManager_Get(DEV_MOTOR_ID);
    if (!node || !node->private_data) return;

    MotorDevice_t* motor = (MotorDevice_t*)node->private_data;

#if MOTOR_MODE_BIPOLAR
    // ========== 双极性模式 ==========
    // 电源设备提供 ALLOW 控制电机转向，不设置 BLOCK
    MotorDeviceId_t id = (ev->power_id == 0) ? DEV_ID_POWER_POS : DEV_ID_POWER_NEG;
    const MotorDeviceGene_t* gene = Motor_GetGene(id);
    if (!gene) return;

    MotorControlCommand_t cmd = {
        .device_id = id,
        .priority = gene->priority,
        .param = 85.0f,
        .timestamp = tickTimer_GetCount()
    };

    if (ev->is_on) {
        if (id == DEV_ID_POWER_POS) {
            cmd.type = CMD_TYPE_RUN_FWD;
            Motor_CmdList_SetAllow(&motor->allow_fwd, cmd);
            MAIN_D("[MOTOR] Bipolar: POWER_POS ON, added allow_fwd\r\n");
        } else {
            cmd.type = CMD_TYPE_RUN_REV;
            Motor_CmdList_SetAllow(&motor->allow_rev, cmd);
            MAIN_D("[MOTOR] Bipolar: POWER_NEG ON, added allow_rev\r\n");
        }
    } else {
        if (id == DEV_ID_POWER_POS) {
            Motor_CmdList_Remove(&motor->allow_fwd, id);
            MAIN_D("[MOTOR] Bipolar: POWER_POS OFF, removed allow_fwd\r\n");
        } else {
            Motor_CmdList_Remove(&motor->allow_rev, id);
            MAIN_D("[MOTOR] Bipolar: POWER_NEG OFF, removed allow_rev\r\n");
        }
    }
#else
    // ========== 单极性模式 ==========
    // 单极性模式下电源设备不参与仲裁，不做任何操作
    // 其他设备（如手动IO）提供某转向的ALLOW即可转
    MAIN_D("[MOTOR] Unipolar mode: power_id=%d, is_on=%d - power device not involved in arbitration\r\n",
           ev->power_id, ev->is_on);
#endif

