HCHCHC99/HB_chuchai_v2.0.0/project/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/Dev/dev_motor.c
    Motor_ArbitrationDecision(motor);
}

void Motor_OnCANEvent(void* payload) {
    // CAN事件处理（暂时保留接口，未实现）
    // MotorCANEvent_t* ev = (MotorCANEvent_t*)payload;
    (void)payload;  // 避免未使用警告
}

// ========== 新增：电机霍尔转速反馈回调 ==========
void Motor_OnSpeedFeedback(void* payload) {
    int32_t* speed_rpm = (int32_t*)payload;

    DeviceNode_t* node = DeviceManager_Get(DEV_MOTOR_ID);
    if (!node || !node->private_data) return;

    MotorDevice_t* motor = (MotorDevice_t*)node->private_data;

    // 可选：根据转速进行闭环控制
    // 例如：根据目标转速调整占空比
    if (motor->state == MS_RUNNING || motor->state == MS_RAMPING) {
        // 可以在这里实现 PID 调速
        // 目前只是接收转速数据，供调试或后续扩展使用
        (void)motor;      // 避免未使用警告
        (void)speed_rpm;  // 避免未使用警告
    }
}

// ========== 标准设备操作接口实现 ==========

DeviceResult_t Motor_Init(void* handle) {
    MotorDevice_t* motor = (MotorDevice_t*)handle;
    if (!motor) return RESULT_PARAM_ERR;

    memset(motor, 0, sizeof(MotorDevice_t));

    // 初始化命令列表
    for(int i = 0; i < MAX_COMMANDS_PER_DIRECTION; i++) {
        motor->allow_fwd.commands[i].device_id = DEV_ID_NONE;
        motor->allow_fwd.commands[i].priority = PRIO_NONE;
        motor->allow_rev.commands[i].device_id = DEV_ID_NONE;
        motor->allow_rev.commands[i].priority = PRIO_NONE;
        motor->block_fwd.commands[i].device_id = DEV_ID_NONE;
        motor->block_rev.commands[i].device_id = DEV_ID_NONE;
    }

    // 初始化IO设备默认状态：每个IO设备默认BLOCK自己的方向
    // IO_FWD默认BLOCK正转，IO_REV默认BLOCK反转
    MotorControlCommand_t io_fwd_block = {
        .device_id = DEV_ID_IO_FWD,
        .priority = MANUAL_PRIORITY,
        .type = CMD_TYPE_BLOCK_FWD,
        .timestamp = tickTimer_GetCount()
    };
    Motor_CmdList_SetBlock(&motor->block_fwd, io_fwd_block);
    
    MotorControlCommand_t io_rev_block = {
        .device_id = DEV_ID_IO_REV,
        .priority = MANUAL_PRIORITY,
        .type = CMD_TYPE_BLOCK_REV,
        .timestamp = tickTimer_GetCount()
    };
    Motor_CmdList_SetBlock(&motor->block_rev, io_rev_block);

    motor->enable = 1;
    motor->last_arbitration_time = tickTimer_GetCount();

    // 设置调试全局指针
    g_pMotor_Dev_Watch = motor;
    
    // 初始化调试变量
    Motor_UpdateDebugInfo(motor);

    // 订阅EventBus事件
    // 注意：订阅统一在 App_Motor_Project.c 的 SetupEventBusSubscriptions() 中管理
    // 这里不再重复订阅，避免回调被多次注册
    

#if MOTOR_CONTROL_MODE == 1
    s_eLastArbitrationDir = DIR_NONE;
    s_u16LastTargetDuty = 0;

    // 同步软件PWM状态与硬件寄存器
    uint32_t period = TMRA_GetPeriodValue(CM_TMRA_4);
    if (period > 0) {
        uint32_t cmp1 = TMRA_GetCompareValue(CM_TMRA_4, TMRA_CH1);
        uint32_t cmp2 = TMRA_GetCompareValue(CM_TMRA_4, TMRA_CH2);
        uint32_t cmp3 = TMRA_GetCompareValue(CM_TMRA_4, TMRA_CH3);
        uint32_t cmp4 = TMRA_GetCompareValue(CM_TMRA_4, TMRA_CH4);
        g_motor_pwm_ch1.dutyPercent = (uint16_t)((cmp1 * 100) / period);
        g_motor_pwm_ch2.dutyPercent = (uint16_t)((cmp2 * 100) / period);
        g_motor_pwm_ch3.dutyPercent = (uint16_t)((cmp3 * 100) / period);
        g_motor_pwm_ch4.dutyPercent = (uint16_t)((cmp4 * 100) / period);
    }
#endif

    MOTOR_DEBUG("Motor_Init completed, g_pMotor_Dev_Watch set\r\n");
    return RESULT_OK;
}

DeviceResult_t Motor_Deinit(void* handle) {
    MotorDevice_t* motor = (MotorDevice_t*)handle;
    if (!motor) return RESULT_PARAM_ERR;

    motor->enable = 0;
    Motor_EmergencyStop(motor);
    
    g_pMotor_Dev_Watch = NULL;
    memset((void*)&g_stcMotorDebug, 0, sizeof(MotorDebugInfo_t));

    return RESULT_OK;
}

DeviceResult_t Motor_Read(void* handle, void* data, uint32_t size) {
    MotorDevice_t* motor = (MotorDevice_t*)handle;
    if (!motor || !data) return RESULT_PARAM_ERR;
    if (!motor->enable) return RESULT_ERROR;

    if (size == sizeof(MotorDebugInfo_t)) {
        memcpy(data, &motor->debug_info, sizeof(MotorDebugInfo_t));
        return RESULT_OK;
    }
    // 新增：支持读取状态结构体
    else if (size == sizeof(Motor_StateInfo_t)) {
        Motor_StateInfo_t* pstcState = (Motor_StateInfo_t*)data;
        pstcState->desired_dir = DIR_NONE;
        if (motor->state == MS_RUNNING || motor->state == MS_RAMPING) {
            pstcState->desired_dir = motor->active_dir;
        }
        pstcState->state = motor->state;
        pstcState->active_dir = motor->active_dir;
        pstcState->current_duty = motor->current_duty;
        pstcState->enable = motor->enable;
        return RESULT_OK;
    }

    return RESULT_PARAM_ERR;
}

DeviceResult_t Motor_Write(void* handle, const void* data, uint32_t size) {
    // 电机设备通常不需要直接写操作
    (void)handle;
    (void)data;
    (void)size;
    return RESULT_ERROR;
}

DeviceResult_t Motor_Control(void* handle, DeviceCommandData_t* cmd) {
    MotorDevice_t* motor = (MotorDevice_t*)handle;
    if (!motor || !cmd) return RESULT_PARAM_ERR;

    switch(cmd->cmd) {
        case CMD_MOTOR_STOP:
            Motor_Stop(motor);
            break;
        case CMD_MOTOR_RUN_FWD:
            Motor_Start(motor, DIR_FWD);
            break;
        case CMD_MOTOR_RUN_REV:
            Motor_Start(motor, DIR_REV);
            break;
        case CMD_MOTOR_SET_SPEED:
            if (cmd->params && cmd->param_size == sizeof(float)) {
                Motor_SetSpeed(motor, *(float*)cmd->params);
            }
            break;
        case CMD_MOTOR_EMERGENCY_STOP:
            Motor_EmergencyStop(motor);
            break;
        case CMD_MOTOR_GET_DESIRED_DIR:
            if (cmd->response && cmd->response_size >= sizeof(uint8_t)) {
                MotorDir_t desired_dir = DIR_NONE;
                if (motor->state == MS_RUNNING || motor->state == MS_RAMPING) {
                    desired_dir = motor->active_dir;
                }
                *(uint8_t*)cmd->response = (uint8_t)desired_dir;
                return RESULT_OK;
            }
            return RESULT_PARAM_ERR;
        default:
            return RESULT_ERROR;
    }

    return RESULT_OK;
}

DeviceResult_t Motor_Update(void* handle) {
    MotorDevice_t* motor = (MotorDevice_t*)handle;
    if (!motor || !motor->enable) return RESULT_ERROR;

#if MOTOR_CONTROL_MODE == 1
    // 更新4通道PWM缓启动状态机
    PWM_Update(&g_motor_pwm_ch1);
    PWM_Update(&g_motor_pwm_ch2);
    PWM_Update(&g_motor_pwm_ch3);
    PWM_Update(&g_motor_pwm_ch4);

    // 检查缓降是否完成，需要切换运行极性再缓升
    if (s_bPolaritySwitchPending) {
        if (PWM_GetState(&g_motor_pwm_ch1) == PWM_STATE_IDLE &&
            PWM_GetState(&g_motor_pwm_ch2) == PWM_STATE_IDLE &&
            PWM_GetState(&g_motor_pwm_ch3) == PWM_STATE_IDLE &&
            PWM_GetState(&g_motor_pwm_ch4) == PWM_STATE_IDLE) {
            /* 缓降完成，切极性 */
            Motor_SetRunPolarity();
            s_bPolaritySwitchPending = false;
            /* 开始缓升到目标 */
            uint16_t duty = s_u16PendingTargetDuty;
            if (s_u8PendingDirection == 1) {
                uint16_t dl = Motor_LimitDuty(duty);
                uint16_t dh = 100 - dl;
                PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch1, 0, dl, MOTOR_RAMP_TIME_MS);
                PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch2, 0, dl, MOTOR_RAMP_TIME_MS);
                PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch3, 0, dh, MOTOR_RAMP_TIME_MS);
                PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch4, 0, dh, MOTOR_RAMP_TIME_MS);
            } else {
                uint16_t dl = 100 - Motor_LimitDuty(duty);
                uint16_t dh = Motor_LimitDuty(duty);
                PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch1, 0, dl, MOTOR_RAMP_TIME_MS);
                PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch2, 0, dl, MOTOR_RAMP_TIME_MS);
                PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch3, 0, dh, MOTOR_RAMP_TIME_MS);
                PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch4, 0, dh, MOTOR_RAMP_TIME_MS);
            }
        }
    }


#endif


    uint32_t now = tickTimer_GetCount();

