HCHCHC99/HB_chuchai_v2.0.0/project/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/Dev/dev_motor.c
    // 每50ms仲裁一次
    if (now - motor->last_arbitration_time >= 50) {
        Motor_ArbitrationDecision(motor);
        motor->last_arbitration_time = now;
    }

    // ========== 每2000ms打印一次电机仲裁状态 ==========
    if (now - s_u32LastMotorPrintTime >= MOTOR_PRINT_INTERVAL_MS) {
        s_u32LastMotorPrintTime = now;

        MOTOR_OUT("=== Motor Arbitration State ===\r\n");

        // 打印当前状态
        const char* state_str = (motor->state == MS_IDLE) ? "IDLE" :
                                (motor->state == MS_RAMPING) ? "RAMPING" :
                                (motor->state == MS_RUNNING) ? "RUNNING" : "LOCKED";
        const char* dir_str = (motor->active_dir == DIR_FWD) ? "FWD" :
                              (motor->active_dir == DIR_REV) ? "REV" : "NONE";
        MOTOR_OUT("  State=%s, ActiveDir=%s, Duty=%.1f%%\r\n",
                  state_str, dir_str, motor->current_duty);

        // 打印正在作用的允许指令
        MOTOR_OUT("  Active Allow FWD: ");
        if (motor->allow_fwd.count > 0) {
            for (int i = 0; i < motor->allow_fwd.count; i++) {
                const char* dev_name = "";
                switch(motor->allow_fwd.commands[i].device_id) {
                    case DEV_ID_IO_FWD: dev_name = "IO_FWD"; break;
                    case DEV_ID_IO_REV: dev_name = "IO_REV"; break;
                    case DEV_ID_CAN: dev_name = "CAN"; break;
                    case DEV_ID_POWER_POS: dev_name = "POWER_POS"; break;
                    case DEV_ID_POWER_NEG: dev_name = "POWER_NEG"; break;
                    default: dev_name = "UNKNOWN"; break;
                }
                MOTOR_OUT("%s(Prio%d) ", dev_name, motor->allow_fwd.commands[i].priority);
            }
        } else {
            MOTOR_OUT("(none)");
        }
        MOTOR_OUT("\r\n");

        MOTOR_OUT("  Active Allow REV: ");
        if (motor->allow_rev.count > 0) {
            for (int i = 0; i < motor->allow_rev.count; i++) {
                const char* dev_name = "";
                switch(motor->allow_rev.commands[i].device_id) {
                    case DEV_ID_IO_FWD: dev_name = "IO_FWD"; break;
                    case DEV_ID_IO_REV: dev_name = "IO_REV"; break;
                    case DEV_ID_CAN: dev_name = "CAN"; break;
                    case DEV_ID_POWER_POS: dev_name = "POWER_POS"; break;
                    case DEV_ID_POWER_NEG: dev_name = "POWER_NEG"; break;
                    default: dev_name = "UNKNOWN"; break;
                }
                MOTOR_OUT("%s(Prio%d) ", dev_name, motor->allow_rev.commands[i].priority);
            }
        } else {
            MOTOR_OUT("(none)");
        }
        MOTOR_OUT("\r\n");

        // 打印正在作用的阻塞指令
        MOTOR_OUT("  Active Block FWD: ");
        if (motor->block_fwd.count > 0) {
            for (int i = 0; i < motor->block_fwd.count; i++) {
                const char* dev_name = "";
                switch(motor->block_fwd.commands[i].device_id) {
                    case DEV_ID_IO_FWD: dev_name = "IO_FWD"; break;
                    case DEV_ID_IO_REV: dev_name = "IO_REV"; break;
                    case DEV_ID_CAN: dev_name = "CAN"; break;
                    case DEV_ID_LIMIT_FWD: dev_name = "LIMIT_FWD"; break;
                    case DEV_ID_LIMIT_REV: dev_name = "LIMIT_REV"; break;
                    case DEV_ID_POWER_POS: dev_name = "POWER_POS"; break;
                    case DEV_ID_POWER_NEG: dev_name = "POWER_NEG"; break;
                    case DEV_ID_RTURN_FWD: dev_name = "RTURN_FWD"; break;
                    case DEV_ID_RTURN_REV: dev_name = "RTURN_REV"; break;
                    case DEV_ID_OVERVOLTAGE_FWD: dev_name = "OVERVOLTAGE_FWD"; break;
                    case DEV_ID_OVERVOLTAGE_REV: dev_name = "OVERVOLTAGE_REV"; break;
                    case DEV_ID_UNDERVOLTAGE_FWD: dev_name = "UNDERVOLTAGE_FWD"; break;
                    case DEV_ID_UNDERVOLTAGE_REV: dev_name = "UNDERVOLTAGE_REV"; break;
                    case DEV_ID_OVERCUR_FWD: dev_name = "OVERCUR_FWD"; break;
                    default: dev_name = "UNKNOWN"; break;
                }
                MOTOR_OUT("%s ", dev_name);
            }
        } else {
            MOTOR_OUT("(none)");
        }
        MOTOR_OUT("\r\n");

        MOTOR_OUT("  Active Block REV: ");
        if (motor->block_rev.count > 0) {
            for (int i = 0; i < motor->block_rev.count; i++) {
                const char* dev_name = "";
                switch(motor->block_rev.commands[i].device_id) {
                    case DEV_ID_IO_FWD: dev_name = "IO_FWD"; break;
                    case DEV_ID_IO_REV: dev_name = "IO_REV"; break;
                    case DEV_ID_CAN: dev_name = "CAN"; break;
                    case DEV_ID_LIMIT_FWD: dev_name = "LIMIT_FWD"; break;
                    case DEV_ID_LIMIT_REV: dev_name = "LIMIT_REV"; break;
                    case DEV_ID_POWER_POS: dev_name = "POWER_POS"; break;
                    case DEV_ID_POWER_NEG: dev_name = "POWER_NEG"; break;
                    case DEV_ID_RTURN_FWD: dev_name = "RTURN_FWD"; break;
                    case DEV_ID_RTURN_REV: dev_name = "RTURN_REV"; break;
                    case DEV_ID_OVERVOLTAGE_FWD: dev_name = "OVERVOLTAGE_FWD"; break;
                    case DEV_ID_OVERVOLTAGE_REV: dev_name = "OVERVOLTAGE_REV"; break;
                    case DEV_ID_UNDERVOLTAGE_FWD: dev_name = "UNDERVOLTAGE_FWD"; break;
                    case DEV_ID_UNDERVOLTAGE_REV: dev_name = "UNDERVOLTAGE_REV"; break;
                    case DEV_ID_OVERCUR_FWD: dev_name = "OVERCUR_FWD"; break;
                    default: dev_name = "UNKNOWN"; break;
                }
                MOTOR_OUT("%s ", dev_name);
            }
        } else {
            MOTOR_OUT("(none)");
        }
        MOTOR_OUT("\r\n");

        // ========== 打印已注册但未作用的设备 ==========
        // 根据设备基因表，检查哪些设备没有在 allow 或 block 列表中
        
        // 收集已作用的设备ID
        uint8_t active_devices[16] = {0};
        uint8_t active_count = 0;
        
        // 添加 allow_fwd 中的设备
        for (int i = 0; i < motor->allow_fwd.count; i++) {
            uint8_t dev_id = motor->allow_fwd.commands[i].device_id;
            bool found = false;
            for (int j = 0; j < active_count; j++) {
                if (active_devices[j] == dev_id) { found = true; break; }
            }
            if (!found) active_devices[active_count++] = dev_id;
        }
        
        // 添加 allow_rev 中的设备
        for (int i = 0; i < motor->allow_rev.count; i++) {
            uint8_t dev_id = motor->allow_rev.commands[i].device_id;
            bool found = false;
            for (int j = 0; j < active_count; j++) {
                if (active_devices[j] == dev_id) { found = true; break; }
            }
            if (!found) active_devices[active_count++] = dev_id;
        }
        
        // 添加 block_fwd 中的设备
        for (int i = 0; i < motor->block_fwd.count; i++) {
            uint8_t dev_id = motor->block_fwd.commands[i].device_id;
            bool found = false;
            for (int j = 0; j < active_count; j++) {
                if (active_devices[j] == dev_id) { found = true; break; }
            }
            if (!found) active_devices[active_count++] = dev_id;
        }
        
        // 添加 block_rev 中的设备
        for (int i = 0; i < motor->block_rev.count; i++) {
            uint8_t dev_id = motor->block_rev.commands[i].device_id;
            bool found = false;
            for (int j = 0; j < active_count; j++) {
                if (active_devices[j] == dev_id) { found = true; break; }
            }
            if (!found) active_devices[active_count++] = dev_id;
        }
        
        // 检查基因表中的所有设备
        MOTOR_OUT("  Registered but Inactive Devices:\r\n");
        bool has_inactive = false;
        
        // 定义所有可能的设备及其名称
        struct { uint8_t id; const char* name; } all_devices[] = {
            {DEV_ID_POWER_POS, "POWER_POS"},
            {DEV_ID_POWER_NEG, "POWER_NEG"},
            {DEV_ID_LIMIT_FWD, "LIMIT_FWD"},
            {DEV_ID_LIMIT_REV, "LIMIT_REV"},
            {DEV_ID_RTURN_FWD, "RTURN_FWD"},
            {DEV_ID_RTURN_REV, "RTURN_REV"},
            {DEV_ID_CAN, "CAN"},
            {DEV_ID_IO_FWD, "IO_FWD"},
            {DEV_ID_IO_REV, "IO_REV"},
            {DEV_ID_EMERGENCY, "EMERGENCY"}
        };
        
