HCHCHC99/HB_chuchai_v2.0.0/project/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/Dev/dev_motor.c
        for (int i = 0; i < sizeof(all_devices)/sizeof(all_devices[0]); i++) {
            bool is_active = false;
            for (int j = 0; j < active_count; j++) {
                if (active_devices[j] == all_devices[i].id) {
                    is_active = true;
                    break;
                }
            }
            if (!is_active) {
                MOTOR_OUT("    %s (ID=%d) - No command\r\n", 
                          all_devices[i].name, all_devices[i].id);
                has_inactive = true;
            }
        }
        
        if (!has_inactive) {
            MOTOR_OUT("    (All registered devices are active)\r\n");
        }
        
        // 打印冲突状态
        MOTOR_OUT("  Conflict=%d\r\n",
                  motor->debug_info.conflict_fault);
        
        // 打印当前活动设备
        const char* active_dev_name = "NONE";
        switch(motor->active_device_id) {
            case DEV_ID_IO_FWD: active_dev_name = "IO_FWD"; break;
            case DEV_ID_IO_REV: active_dev_name = "IO_REV"; break;
            case DEV_ID_CAN: active_dev_name = "CAN"; break;
            case DEV_ID_POWER_POS: active_dev_name = "POWER_POS"; break;
            case DEV_ID_POWER_NEG: active_dev_name = "POWER_NEG"; break;
            case DEV_ID_LIMIT_FWD: active_dev_name = "LIMIT_FWD"; break;
            case DEV_ID_LIMIT_REV: active_dev_name = "LIMIT_REV"; break;
            case DEV_ID_OVERCUR_FWD: active_dev_name = "OVERCUR_FWD"; break;
            default: active_dev_name = "NONE"; break;
        }
        MOTOR_OUT("  Active Device: %s (ID=%d)\r\n", active_dev_name, motor->active_device_id);
    }
    
    return RESULT_OK;
}

// ========== 电机特定接口实现 ==========

void Motor_SetSpeed(MotorDevice_t* motor, float duty) {
    if (!motor || !motor->enable) return;
    
    DeviceCommandData_t cmd;
    uint16_t duty_percent = (uint16_t)(duty * 100.0f);
    cmd.cmd = CMD_PWM_SET_DUTY;
    cmd.params = &duty_percent;
    cmd.param_size = sizeof(uint16_t);
    Device_Control(DEV_PWM_MOTOR_ID, &cmd);
}

void Motor_Start(MotorDevice_t* motor, MotorDir_t dir) {
    if (!motor || !motor->enable) return;
    
    // 通过EventBus发布启动事件，让仲裁层处理
    MotorManualIOEvent_t ev = {
        .dir = dir,
        .type = CMD_TYPE_RUN_FWD,
        .speed = 50.0f
    };
    
    if (dir == DIR_FWD) {
        ev.type = CMD_TYPE_RUN_FWD;
    } else if (dir == DIR_REV) {
        ev.type = CMD_TYPE_RUN_REV;
    }
    
    EventBus_Publish(TOPIC_MANUAL_IO, &ev);
}

void Motor_Stop(MotorDevice_t* motor) {
    if (!motor) return;
    
    MotorManualIOEvent_t ev = {
        .dir = DIR_NONE,
        .type = CMD_TYPE_STOP,
        .speed = 0
    };
    
    EventBus_Publish(TOPIC_MANUAL_IO, &ev);
}

void Motor_EmergencyStop(MotorDevice_t* motor) {
    if (!motor) return;
    
    MOTOR_DEBUG("EmergencyStop: clearing all allow commands\r\n");
    
    // 紧急停止：真正清空 allow_fwd 的 commands[] 数组
    for (int i = 0; i < MAX_COMMANDS_PER_DIRECTION; i++) {
        motor->allow_fwd.commands[i].device_id = DEV_ID_NONE;
        motor->allow_fwd.commands[i].priority = PRIO_NONE;
        motor->allow_fwd.commands[i].type = CMD_TYPE_NONE_USE;
        motor->allow_fwd.commands[i].param = 0.0f;
        motor->allow_fwd.commands[i].timestamp = 0;
    }
    motor->allow_fwd.count = 0;
    
    // 紧急停止：真正清空 allow_rev 的 commands[] 数组
    for (int i = 0; i < MAX_COMMANDS_PER_DIRECTION; i++) {
        motor->allow_rev.commands[i].device_id = DEV_ID_NONE;
        motor->allow_rev.commands[i].priority = PRIO_NONE;
        motor->allow_rev.commands[i].type = CMD_TYPE_NONE_USE;
        motor->allow_rev.commands[i].param = 0.0f;
        motor->allow_rev.commands[i].timestamp = 0;
    }
    motor->allow_rev.count = 0;
    
    // 注意：不清理 block_fwd / block_rev！
    
    // 更新调试变量
    g_u8MotorDebug_AllowFwdCount = 0;
    g_u8MotorDebug_AllowRevCount = 0;
    
    Motor_ArbitrationDecision(motor);
}

void Motor_ClearAllowFwd(MotorDevice_t* motor) {
    if (!motor) return;
    
    MOTOR_DEBUG("ClearAllowFwd: clearing all allow_fwd commands\r\n");
    
    // 真正清空 commands[] 数组
    for (int i = 0; i < MAX_COMMANDS_PER_DIRECTION; i++) {
        motor->allow_fwd.commands[i].device_id = DEV_ID_NONE;
        motor->allow_fwd.commands[i].priority = PRIO_NONE;
        motor->allow_fwd.commands[i].type = CMD_TYPE_NONE_USE;
        motor->allow_fwd.commands[i].param = 0.0f;
        motor->allow_fwd.commands[i].timestamp = 0;
    }
    motor->allow_fwd.count = 0;
    
    // 更新调试变量
    g_u8MotorDebug_AllowFwdCount = 0;
    
    // 重新仲裁
    Motor_ArbitrationDecision(motor);
}

void Motor_ClearAllowRev(MotorDevice_t* motor) {
    if (!motor) return;
    
    MOTOR_DEBUG("ClearAllowRev: clearing all allow_rev commands\r\n");
    
    // 真正清空 commands[] 数组
    for (int i = 0; i < MAX_COMMANDS_PER_DIRECTION; i++) {
        motor->allow_rev.commands[i].device_id = DEV_ID_NONE;
        motor->allow_rev.commands[i].priority = PRIO_NONE;
        motor->allow_rev.commands[i].type = CMD_TYPE_NONE_USE;
        motor->allow_rev.commands[i].param = 0.0f;
        motor->allow_rev.commands[i].timestamp = 0;
    }
    motor->allow_rev.count = 0;
    
    // 更新调试变量
    g_u8MotorDebug_AllowRevCount = 0;
    
    // 重新仲裁
    Motor_ArbitrationDecision(motor);
}

const MotorDebugInfo_t* Motor_GetDebugInfo(MotorDevice_t* motor) {
    if (!motor) return NULL;
    return &motor->debug_info;
}

MotorDir_t Motor_GetDesiredDirection(MotorDevice_t* motor) {
    if (!motor) return DIR_NONE;
    // 如果当前有正在执行的命令，返回其方向
    if (motor->state == MS_RUNNING || motor->state == MS_RAMPING) {
        return motor->active_dir;
    }
    return DIR_NONE;
}

// ========== 过流告警手动清除接口 ==========
void Motor_ClearOvercurrentBlock(MotorDevice_t* motor) {
    if (!motor) return;
    
    MOTOR_DEBUG("ClearOvercurrentBlock: removing block_fwd for DEV_ID_OVERCUR_FWD\r\n");
    
    Motor_CmdList_Remove(&motor->block_fwd, DEV_ID_OVERCUR_FWD);
    
    // 重新仲裁
    Motor_ArbitrationDecision(motor);
}

// ========== 电压告警手动清除接口 ==========
void Motor_ClearVoltageBlock(MotorDevice_t* motor, uint8_t u8AlarmType) {
    if (!motor) return;
    
    MotorDeviceId_t dev_id_fwd, dev_id_rev;
    const char* alarm_name;
    
    if (u8AlarmType == VOLTAGE_ALARM_OVERVOLTAGE) {
        dev_id_fwd = DEV_ID_OVERVOLTAGE_FWD;
        dev_id_rev = DEV_ID_OVERVOLTAGE_REV;
        alarm_name = "OVERVOLTAGE";
    } else if (u8AlarmType == VOLTAGE_ALARM_UNDERVOLTAGE) {
        dev_id_fwd = DEV_ID_UNDERVOLTAGE_FWD;
        dev_id_rev = DEV_ID_UNDERVOLTAGE_REV;
        alarm_name = "UNDERVOLTAGE";
    } else {
        return;
    }
    
    MOTOR_DEBUG("ClearVoltageBlock: %s - removing block_fwd/rev\r\n", alarm_name);
    
    Motor_CmdList_Remove(&motor->block_fwd, dev_id_fwd);
    Motor_CmdList_Remove(&motor->block_rev, dev_id_rev);
    
    // 重新仲裁
    Motor_ArbitrationDecision(motor);
}
